Repository: danielaa-stan/yesnomaybeapp
Catalog: lib/l10n/app_*.arb
Languages: uk

# nameHint
source: Name
uk: Ім'я

source: Name cannot be empty!
uk: Поле імені не може бути пустим

source: Name must be at least 3 characters.
uk: Ім'я повинне мати щонайменше 3 символи

# profileBioTitle
source: Bio
uk: Про себе

# profileBioPlaceholder
source: This is all about you
uk: Ну давай, розкажи трохи про себе

# languageTitle
source: Language
uk: Мова

# editProfileTitle
source: Edit profile
uk: Редагувати профіль

source: Chosen interests
uk: Обрані інтереси

# addMoreInterests
source: Add more
uk: Додати ще

# yourPollsHeader
source: Your polls
uk: Твої опитування

# yourVotesHeader
source: Your votes
uk: Твої голоси

# saveButton
source: SAVE CHANGES
uk: ЗБЕРЕГТИ ЗМІНИ

# cancelButton
source: CANCEL
uk: СКАСУВАТИ

# pollTitleHint
source: Title
uk: Назва

# pollDescriptionHint
source: Description
uk: Опис

# buttonAddOption
source: Add option
uk: Додати варіант

# postButton
source: POST
uk: ОПУБЛІКУВАТИ

# changePhotoButton
source: Change photo
uk: Змінити фото

# searchBarHint
source: Search
uk: Пошук

# noPollsFound
source: Sorry! Looks like there is no polls like that :(
uk: Хм… здається, такого опитування нема :(

# searchPageHeader
source: Look it up!
uk: Шукай, не соромся!

# searchPageSubheader
source: Or choose the HOT topic for today
uk: Або обери тему, що зараз у тренді

# messageNoPolls
source: You haven't created any polls yet.
uk: Тут поки порожньо. Створи своє перше опитування!

# messageNoVotes
source: You haven't voted in any polls yet.
uk: Ще не голосував? Саме час це виправити!

# makePickButton
source: Make your pick
uk: Зробити вибір

# moreButton
source: More
uk: Більше

# lessButton
source: Less
uk: Менше

# homepageGreeting
source: Hello,
uk: Привіт,

# homepageSubheader
source: Ready to vote today?
uk: Маєш настрій трохи поголосувати?

# homepageHeader
source: Hot picks for you
uk: Популярні теми сьогодні

# notificationsHeader
source: Notifications
uk: Сповіщення

# notificationsSubheader
source: System notifications
uk: Системні сповіщення

# notificationsDailyOption
source: Daily reminder
uk: Щоденне нагадування

# notificationsActivityOption
source: Activity on your poll
uk: Нова активність у твоєму опитуванні

# notificationsInterestsOption
source: New poll in your interests
uk: Нове опитування по твоїх інтересах

# createPollButton
source: Create a poll
uk: Створити опитування

# findPollButton
source: Find the poll
uk: Знайти опитування

# snackBarVoteSuccess
source: Thank you for your vote! :)
uk: Дякуємо за ваш голос! :)

# logoutButton
source: LOG OUT
uk: ВИЙТИ З ПРОФІЛЮ

# deletedPollSnackBar
source: Poll deleted successfully!
uk: Опитування видалено успішно!

source: Select more interests
uk: Оберіть більше інтересів

# interestsConfirmButton
source: CONFIRM
uk: ПІДТВЕРДИТИ

source: Uploading photo...
uk: Завантаження фото...

# uploadPhotoSuccess
source: Photo uploaded successfully!
uk: Фото завантажено успішно!

# uploadPhotoFail
source: Photo upload failed!
uk: Помилка завантаження фото!

# thePollsYouCreated
source: Polls you proudly crafted
uk: Опитування, якими ти можеш пишатися

# thePollsYouVotedIn
source: Your votes in action
uk: Опитування, де твій голос уже в справі

# enterTitle
source: Please enter a title for your poll.
uk: Будь ласка введіть назву для опитування.

# provideAtLeast2Options
source: Please provide at least two valid poll options.
uk: Необхідні щонайменше дві опції для вибору.

source: Poll posted successfully!
uk: Опитування опубліковано успішно!

# setUpNewPoll
source: Set up your new poll
uk: Створи нове опитування

source: Give some details
uk: Додай всі деталі

# pollOption
source: Option
uk: Опція

# selectTag
source: Select a tag
uk: Оберіть тег

source: Poll successfully updated!
uk: Опитування успішно оновлено!

source: Error updating poll
uk: Помилка при оновленні опитування

source: Edit poll
uk: Редагувати опитування

source: Logged in successfully!
uk: Успішний вхід!

source: Invalid email or password.
uk: Невірний email або пароль.

source: An error occurred.
uk: Сталася помилка.

source: Sign In
uk: Увійти

# emailCannotBeEmpty
source: Email field cannot be empty.
uk: Поле email не може бути порожнім.

# enterValidEmailFormat
source: Please enter a valid email format.
uk: Введи дійсний формат email.

# passwordHint
source: Password
uk: Пароль

# passwordCannotBeEmpty
source: Password field cannot be empty.
uk: Поле пароля не може бути порожнім.

# passwordMustHaveAtLeast
source: Password must be at least 6 characters.
uk: Пароль має містити щонайменше 6 символів.

# signInButton
source: SIGN IN
uk: УВІЙТИ

# dontHaveAccount
source: Don't have an account?
uk: Ще немає акаунту?

source: Sign up
uk: Зареєструватися

# accountCreated
source: Account created! Please check your email for verification.
uk: Акаунт створено! Будь ласка, перевір свою пошту для підтвердження.

# theEmailIsAlreadyInUse
source: The email address is already in use by another account.
uk: Ця електронна адреса вже використовується іншим акаунтом.

source: Hummm?
uk: Хммм…?

source: Create account
uk: Створити акаунт

# agreeWith
source: I agree with
uk: Я погоджуюсь з

# termsAndCond
source: Terms & Conditions
uk: Правилами та Умовами

# termsAndCondMessage
source: Please agree to terms and conditions.
uk: Будь ласка, погодься з правилами та умовами.

# signUpButton
source: SIGN UP
uk: ЗАРЕЄСТРУВАТИСЯ

source: Already have an account?
uk: Вже маєту акаунт?

source: Results are processing...
uk: Результати обробляються...
